In [1]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df=pd.read_csv("tree.csv")

In [3]:
df.head()

  company                job education  sal_more_than_50K
0     TCS  PROJECT EXECUTIVE    B.TECH                  0
1     TCS  PROJECT EXECUTIVE    M.TECH                  0
2     TCS    PROJECT MANAGER    B.TECH                  1
3     TCS    PROJECT MANAGER    M.TECH                  1
4     TCS         PROGRAMMER    B.TECH                  0

In [4]:
df.head(5)

  company                job education  sal_more_than_50K
0     TCS  PROJECT EXECUTIVE    B.TECH                  0
1     TCS  PROJECT EXECUTIVE    M.TECH                  0
2     TCS    PROJECT MANAGER    B.TECH                  1
3     TCS    PROJECT MANAGER    M.TECH                  1
4     TCS         PROGRAMMER    B.TECH                  0

In [6]:
df.company.unique()

array(['TCS', 'INFOSYS', 'MICROSOFT'], dtype=object)

In [8]:
x=df[['company','job','education']]

In [9]:
x

      company                job education
0         TCS  PROJECT EXECUTIVE    B.TECH
1         TCS  PROJECT EXECUTIVE    M.TECH
2         TCS    PROJECT MANAGER    B.TECH
3         TCS    PROJECT MANAGER    M.TECH
4         TCS         PROGRAMMER    B.TECH
5         TCS         PROGRAMMER    M.TECH
6     INFOSYS  PROJECT EXECUTIVE    M.TECH
7     INFOSYS         PROGRAMMER    B.TECH
8     INFOSYS    PROJECT MANAGER    B.TECH
9     INFOSYS    PROJECT MANAGER    M.TECH
10  MICROSOFT  PROJECT EXECUTIVE    B.TECH
11  MICROSOFT  PROJECT EXECUTIVE    M.TECH
12  MICROSOFT    PROJECT MANAGER    B.TECH
13  MICROSOFT    PROJECT MANAGER    M.TECH
14  MICROSOFT         PROGRAMMER    B.TECH
15  MICROSOFT         PROGRAMMER    M.TECH

In [10]:
from sklearn.preprocessing import LabelEncoder

In [11]:
le = LabelEncoder

In [ ]:
x=le.x